api/app/controllers/api/v1/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  def index
      posts = Post.all.order(created_at: :desc)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
      post = Post.find(params[:id])

INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "Good morning, Tomo!"], ["created_at", "2024-01-04 21:09:07.137017"], ["updated_at", "2024-01-04 21:09:07.137017"]]
---
  def create
      post = Post.new(post_params)
      if post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "Good morning, Asami!"], ["updated_at", "2024-01-05 01:13:55.379968"], ["id", 4]]
---
  def update
      post = Post.find(params[:id])
      if post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 3]]
---
  def destroy
      post = Post.find(params[:id])
      post.destroy